HELLO_MSG = """✨ <b>Добро пожаловать в SnackPost!</b>

Я - ваш интеллектуальный помощник для работы с текстами. Вот что я умею:

<blockquote>📚 <b>Анализировать статьи</b> - присылайте ссылки, и я сделаю краткую выжимку

✍️ <b>Адаптировать контент</b> - помогу переработать текст по вашим пожеланиям</blockquote>

Начните прямо сейчас - отправьте мне ссылку на статью с командой /summarize (или /s).

Для доступа ко всем возможностям оформите подписку в разделе /profile"""

PROFILE_MSG = """👤 <b>Ваш профиль</b>

Здесь вы можете управлять подпиской и проверять её статус."""

NO_SUBSCRIPTION_MSG = """ℹ️ <b>Информация о подписке</b>

У вас нет активной подписки.

Для доступа ко всем функциям бота оформите подписку. (свяжитесь с @p_voronin)"""

SUBSCRIPTION_INFO_MSG = """ℹ️ <b>Информация о подписке</b>

Статус: {status}
Истекает: {expires_at}"""

PAYMENT_OPTIONS_MSG = """💳 <b>Выберите вариант подписки</b>

1 месяц - X₽
3 месяца - XX₽
1 год - XXX₽"""

SUBSCRIPTION_REQUIRED_MSG = """🔒 <b>Требуется подписка</b>

Эта функция доступна только для пользователей с активной подпиской.

Оформите подписку с помощью команды /profile"""